'''
问题描述：
摩尔斯电码定义了一种标准编码，把每个字母映射到一系列点和短划线，
例如：a -> .-，b -> -...，c ->-.-.。

给出26个字母的完整编码表格：
[".-","-...","-.-.","-..",".","..-.","--.",
"....","..",".---","-.-",".-..","--","-.",
"---",".--.","--.-",".-.","...","-","..-",
"...-",".--","-..-","-.--","--.."]

现在给定一个单词列表，每个单词中每个字母可以写成摩尔斯编码。 例如，cab可以写成-.-.-....-，（把c,a,b的莫尔斯编码串接起来）。 我们称之为一个词的转换。

返回所有单词中不同变换的数量。

示例：
输入: words = ["gin", "zen", "gig", "msg"]
输出: 2
解释:
每一个单词的变换是:
"gin" -> "--...-."
"zen" -> "--...-."
"gig" -> "--...--."
"msg" -> "--...--."

这里有两种不同的变换结果： "--...-."和"--...--.".

思路：扫描words列表就好了

'''


def uniqueMorseRepresentations(words):
    # Write your code here
    morse_list = [".-", "-...", "-.-.", "-..", ".", "..-.", "--.", "....", "..", ".---", "-.-", ".-..", "--", "-.",
                  "---", ".--.", "--.-", ".-.", "...", "-", "..-", "...-", ".--", "-..-", "-.--", "--.."]
    result_list = []
    for word in words:
        temp = ''
        for chr in word:
            temp += morse_list[ord(chr) - 97]
        if temp in result_list:
            continue
        else:
            result_list.append(temp)
    return len(result_list)


if __name__ == '__main__':
    words = ["gin", "zen", "gig", "msg"]
    print(uniqueMorseRepresentations(words))
